fixing file formats
